In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv("../data/employees.csv")
df

,employee_id,first_name,last_name,email,phone_number,job_id,salary,commission_pct,manager_id,department_id
0,100,Steven,King,SKING,515.123.4567,AD_PRES,24000.0,NaN,NaN,90.0
1,101,N_ann,Kochhar,NKOCHHAR,515.123.4568,AD_VP,17000.0,NaN,100.0,90.0
2,102,Lex,De Haan,LDEHAAN,515.123.4569,AD_VP,17000.0,NaN,100.0,90.0
3,103,Alexander,Hunold,AHUNOLD,590.423.4567,IT_PROG,9000.0,NaN,102.0,60.0
4,104,Bruce,Ernst,BERNST,590.423.4568,IT_PROG,6000.0,NaN,103.0,60.0
...,...,...,...,...,...,...,...,...,...,...
102,202,Pat,Fay,PFAY,603.123.6666,MK_REP,6000.0,NaN,201.0,20.0
103,203,Susan,Mavris,SMAVRIS,515.123.7777,HR_REP,6500.0,NaN,101.0,40.0
104,204,Hermann,Baer,HBAER,515.123.8888,PR_REP,10000.0,NaN,101.0,70.0
105,205,Shelley,Higgins,SHIGGINS,515.123.8080,AC_MGR,12000.0,NaN,101.0,110.0
106,206,William,Gietz,WGIETZ,515.123.8181,AC_ACCOUNT,8300.0,NaN,205.0,110.0

print(df.groupby("department_id"))

1.查看分组

In [5]:
df.groupby("department_id").groups # 查看分组结果

{10.0: [100], 20.0: [101, 102], 30.0: [14, 15, 16, 17, 18, 19], 40.0: [103], 50.0: [20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99], 60.0: [3, 4, 5, 6, 7], 70.0: [104], 80.0: [45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 79], 90.0: [0, 1, 2], 100.0: [8, 9, 10, 11, 12, 13], 110.0: [105, 106]}

In [8]:
df.groupby("department_id").get_group(50) # # 获取分组为50的数据

,employee_id,first_name,last_name,email,phone_number,job_id,salary,commission_pct,manager_id,department_id
20,120,Matthew,Weiss,MWEISS,650.123.1234,ST_MAN,8000.0,NaN,100.0,50.0
21,121,Adam,Fripp,AFRIPP,650.123.2234,ST_MAN,8200.0,NaN,100.0,50.0
22,122,Payam,Kaufling,PKAUFLIN,650.123.3234,ST_MAN,7900.0,NaN,100.0,50.0
23,123,Shanta,Vollman,SVOLLMAN,650.123.4234,ST_MAN,6500.0,NaN,100.0,50.0
24,124,Kevin,Mourgos,KMOURGOS,650.123.5234,ST_MAN,5800.0,NaN,100.0,50.0
25,125,Julia,Nayer,JNAYER,650.124.1214,ST_CLERK,3200.0,NaN,120.0,50.0
26,126,Irene,Mikkilineni,IMIKKILI,650.124.1224,ST_CLERK,2700.0,NaN,120.0,50.0
27,127,James,Landry,JLANDRY,650.124.1334,ST_CLERK,2400.0,NaN,120.0,50.0
28,128,Steven,Markle,SMARKLE,650.124.1434,ST_CLERK,2200.0,NaN,120.0,50.0
29,129,Laura,Bissot,LBISSOT,650.124.5234,ST_CLERK,3300.0,NaN,121.0,50.0
30,130,Mozhe,Atkinson,MATKINSO,650.124.6234,ST_CLERK,2800.0,NaN,121.0,50.0
31,131,James,Marlow,JAMRLOW,650.124.7234,ST_CLERK,2500.0,NaN,121.0,50.0
32,132,TJ,Olson,TJOLSON,650.124.8234,ST_CLERK,2100.0,NaN,121.0,50.0
33,133,Jason,Mallin,JMALLIN,650.127.1934,ST_CLERK,3300.0,NaN,122.0,50.0
34,134,Michael,Rogers,MROGERS,650.127.1834,ST_CLERK,2900.0,NaN,122.0,50.0
35,135,Ki,Gee,KGEE,650.127.1734,ST_CLERK,2400.0,NaN,122.0,50.0
36,136,Hazel,Philtanker,HPHILTAN,650.127.1634,ST_CLERK,2200.0,NaN,122.0,50.0
37,137,Renske,Ladwig,RLADWIG,650.121.1234,ST_CLERK,3600.0,NaN,123.0,50.0
38,138,Stephen,Stiles,SSTILES,650.121.2034,ST_CLERK,3200.0,NaN,123.0,50.0
39,139,John,Seo,JSEO,650.121.2019,ST_CLERK,2700.0,NaN,123.0,50.0
40,140,Joshua,Patel,JPATEL,650.121.1834,ST_CLERK,2500.0,NaN,123.0,50.0
41,141,Trenna,Rajs,TRAJS,650.121.8009,ST_CLERK,3500.0,NaN,124.0,50.0
42,142,Curtis,Davies,CDAVIES,650.121.2994,ST_CLERK,3100.0,NaN,124.0,50.0
43,143,Randall,Matos,RMATOS,650.121.2874,ST_CLERK,2600.0,NaN,124.0,50.0
44,144,Peter,Vargas,PVARGAS,650.121.2004,ST_CLERK,2500.0,NaN,124.0,50.0
80,180,Winston,Taylor,WTAYLOR,650.507.9876,SH_CLERK,3200.0,NaN,120.0,50.0
81,181,Jean,Fleaur,JFLEAUR,650.507.9877,SH_CLERK,3100.0,NaN,120.0,50.0
82,182,Martha,Sullivan,MSULLIVA,650.507.9878,SH_CLERK,2500.0,NaN,120.0,50.0
83,183,Girard,Geoni,GGEONI,650.507.9879,SH_CLERK,2800.0,NaN,120.0,50.0
84,184,Nandita,Sarchand,NSARCHAN,650.509.1876,SH_CLERK,4200.0,NaN,121.0,50.0
85,185,Alexis,Bull,ABULL,650.509.2876,SH_CLERK,4100.0,NaN,121.0,50.0
86,186,Julia,Dellinger,JDELLING,650.509.3876,SH_CLERK,3400.0,NaN,121.0,50.0
87,187,Anthony,Cabrio,ACABRIO,650.509.4876,SH_CLERK,3000.0,NaN,121.0,50.0
88,188,Kelly,Chung,KCHUNG,650.505.1876,SH_CLERK,3800.0,NaN,122.0,50.0
89,189,Jennifer,Dilly,JDILLY,650.505.2876,SH_CLERK,3600.0,NaN,122.0,50.0
90,190,Timothy,Gates,TGATES,650.505.3876,SH_CLERK,2900.0,NaN,122.0,50.0
91,191,Randall,Perkins,RPERKINS,650.505.4876,SH_CLERK,2500.0,NaN,122.0,50.0
92,192,Sarah,Bell,SBELL,650.501.1876,SH_CLERK,4000.0,NaN,123.0,50.0
93,193,Britney,Everett,BEVERETT,650.501.2876,SH_CLERK,3900.0,NaN,123.0,50.0
94,194,Samuel,McCain,SMCCAIN,650.501.3876,SH_CLERK,3200.0,NaN,123.0,50.0
95,195,Vance,Jones,VJONES,650.501.4876,SH_CLERK,2800.0,NaN,123.0,50.0
96,196,Alana,Walsh,AWALSH,650.507.9811,SH_CLERK,3100.0,NaN,124.0,50.0
97,197,Kevin,Feeney,KFEENEY,650.507.9822,SH_CLERK,3000.0,NaN,124.0,50.0
98,198,Donald,OConnell,DOCONNEL,650.507.9833,SH_CLERK,2600.0,NaN,124.0,50.0
99,199,Douglas,Grant,DGRANT,650.507.9844,SH_CLERK,2600.0,NaN,124.0,50.0

2.按列取值

In [9]:
df.groupby("department_id")["salary"].mean()

department_id
10.0      4400.000000
20.0      9500.000000
30.0      4150.000000
40.0      6500.000000
50.0      3475.555556
60.0      5760.000000
70.0     10000.000000
80.0      8955.882353
90.0     19333.333333
100.0     8600.000000
110.0    10150.000000
Name: salary, dtype: float64

3.按组迭代

In [10]:
for dept_id,group in df.groupby("department_id"):
    print(f"当前组为{dept_id}，组里的数据情况{group.shape}:")
    print(group.iloc[:,0:3])
    print("-------------------")

当前组为10.0，组里的数据情况(1, 10):
     employee_id first_name last_name
100          200   Jennifer    Whalen
-------------------
当前组为20.0，组里的数据情况(2, 10):
     employee_id first_name  last_name
101          201    Michael  Hartstein
102          202        Pat        Fay
-------------------
当前组为30.0，组里的数据情况(6, 10):
    employee_id first_name   last_name
14          114        Den    Raphaely
15          115  Alexander        Khoo
16          116     Shelli       Baida
17          117      Sigal      Tobias
18          118        Guy      Himuro
19          119      Karen  Colmenares
-------------------
当前组为40.0，组里的数据情况(1, 10):
     employee_id first_name last_name
103          203      Susan    Mavris
-------------------
当前组为50.0，组里的数据情况(45, 10):
    employee_id first_name    last_name
20          120    Matthew        Weiss
21          121       Adam        Fripp
22          122      Payam     Kaufling
23          123     Shanta      Vollman
24          124      Kevin      Mourgos
25          125      Julia        Nayer
26          126      Irene  Mikkilineni
27          127      James       Landry
28          128     Steven       Markle
29          129      Laura       Bissot
30          130      Mozhe     Atkinson
31          131      James       Marlow
32          132         TJ        Olson
33          133      Jason       Mallin
34          134    Michael       Rogers
35          135         Ki          Gee
36          136      Hazel   Philtanker
37          137     Renske       Ladwig
38          138    Stephen       Stiles
39          139       John          Seo
40          140     Joshua        Patel
41          141     Trenna         Rajs
42          142     Curtis       Davies
43          143    Randall        Matos
44          144      Peter       Vargas
80          180    Winston       Taylor
81          181       Jean       Fleaur
82          182     Martha     Sullivan
83          183     Girard        Geoni
84          184    Nandita     Sarchand
85          185     Alexis         Bull
86          186      Julia    Dellinger
87          187    Anthony       Cabrio
88          188      Kelly        Chung
89          189   Jennifer        Dilly
90          190    Timothy        Gates
91          191    Randall      Perkins
92          192      Sarah         Bell
93          193    Britney      Everett
94          194     Samuel       McCain
95          195      Vance        Jones
96          196      Alana        Walsh
97          197      Kevin       Feeney
98          198     Donald     OConnell
99          199    Douglas        Grant
-------------------
当前组为60.0，组里的数据情况(5, 10):
   employee_id first_name  last_name
3          103  Alexander     Hunold
4          104      Bruce      Ernst
5          105      David     Austin
6          106      Valli  Pataballa
7          107      Diana    Lorentz
-------------------
当前组为70.0，组里的数据情况(1, 10):
     employee_id first_name last_name
104          204    Hermann      Baer
-------------------
当前组为80.0，组里的数据情况(34, 10):
    employee_id   first_name   last_name
45          145         John     Russell
46          146        Karen    Partners
47          147      Alberto   Errazuriz
48          148       Gerald   Cambrault
49          149        Eleni     Zlotkey
50          150        Peter      Tucker
51          151        David   Bernstein
52          152        Peter        Hall
53          153  Christopher       Olsen
54          154      Nanette   Cambrault
55          155       Oliver     Tuvault
56          156      Janette        King
57          157      Patrick       Sully
58          158        Allan      McEwen
59          159      Lindsey       Smith
60          160       Louise       Doran
61          161       Sarath      Sewall
62          162        Clara     Vishney
63          163     Danielle      Greene
64          164       Mattea     Marvins
65          165        David         Lee
66          166       Sundar        Ande
67          167         Amit       Banda
68          168         Lisa        Ozer
69          169     Harrison       Bloom
70          170       Tayler         Fox
71          171      William       Smith
72          172    Elizabeth       Bates
73          173      Sundita       Kumar
74          174        Ellen        Abel
75          175       Alyssa      Hutton
76          176     Jonathon      Taylor
77          177         Jack  Livingston
79          179      Charles     Johnson
-------------------
当前组为90.0，组里的数据情况(3, 10):
   employee_id first_name last_name
0          100     Steven      King
1          101      N_ann   Kochhar
2          102        Lex   De Haan
-------------------
当前组为100.0，组里的数据情况(6, 10):
    employee_id   first_name  last_name
8           108        Nancy  Greenberg
9           109       Daniel     Faviet
10          110         John       Chen
11          111       Ismael    Sciarra
12          112  Jose Manuel      Urman
13          113         Luis       Popp
-------------------
当前组为110.0，组里的数据情况(2, 10):
     employee_id first_name last_name
105          205    Shelley   Higgins
106          206    William     Gietz
-------------------

4.按多字段分组

In [13]:
salary_mean = df.groupby(["department_id", "job_id"],as_index=False)[
    ["salary", "commission_pct"]
].mean()
salary_mean

    department_id      job_id        salary  commission_pct
0            10.0     AD_ASST   4400.000000             NaN
1            20.0      MK_MAN  13000.000000             NaN
2            20.0      MK_REP   6000.000000             NaN
3            30.0    PU_CLERK   2780.000000             NaN
4            30.0      PU_MAN  11000.000000             NaN
5            40.0      HR_REP   6500.000000             NaN
6            50.0    SH_CLERK   3215.000000             NaN
7            50.0    ST_CLERK   2785.000000             NaN
8            50.0      ST_MAN   7280.000000             NaN
9            60.0     IT_PROG   5760.000000             NaN
10           70.0      PR_REP  10000.000000             NaN
11           80.0      SA_MAN  12200.000000        0.300000
12           80.0      SA_REP   8396.551724        0.212069
13           90.0     AD_PRES  24000.000000             NaN
14           90.0       AD_VP  17000.000000             NaN
15          100.0  FI_ACCOUNT   7920.000000             NaN
16          100.0      FI_MGR  12000.000000             NaN
17          110.0  AC_ACCOUNT   8300.000000             NaN
18          110.0      AC_MGR  12000.000000             NaN